[
    {
        "id": "1",
        "title": "Choosing the Right Serverless Stack: Firebase vs. Supabase",
        "date": "JULY 17, 2025",
        "content": [
            "Currently knee-deep in developing the onboarding flow for my latest app, Rektonic, I’ve hit an interesting crossroad—deciding between Firebase and Supabase for authentication and database management. Both serverless solutions have their merits, but the question is: which aligns best with my vision?",
            "Firebase offers seamless integration with my iOS app and real-time updates that are hard to beat. Supabase, on the other hand, tempts with open-source flexibility, Postgres power, and greater control over user data. Right now, I’m leaning toward Supabase for its transparency and customizable features, but Firebase’s polished ecosystem still calls to me.",
            "As I work through the onboarding sections, focusing on smooth UI transitions and intuitive design, the decision becomes crucial. The goal is to make users’ first interaction frictionless, engaging, and memorable.",
            "In parallel, I’m also fine-tuning an NLP-based model to integrate a more interactive and engaging experience for users. The goal is for Rektonic not just to track habits but also to motivate and entertain through dynamic interactions and personalized feedback.",
            "Stay tuned—I’ll share my final pick and more development insights soon!"
        ],
        "tags": ["Serverless", "Authentication", "Onboarding", "NLP", "Mobile", "Firebase", "Supabase"]
    },
    {
        "id": "2",
        "title": "Creating RETRO-JENNY 87: My AI Chatbot",
        "date": "JULY 10, 2025",
        "content": [
            "Meet RETRO-JENNY 87, my latest creation in the world of AI chatbots. She's not your typical assistant - she's a sassy, 80s-inspired digital personality with a flair for neon and a passion for retro tech.",
            "The idea came from my love of 80s cyberpunk aesthetics and the desire to create something more engaging than the usual corporate AI assistants. JENNY runs on a combination of vanilla JavaScript and pure attitude, with a personality database that includes valley girl speech patterns, 80s pop culture references, and a healthy dose of digital sass.",
            "Key features include: Dynamic personality system with contextual responses, secret commands (try /help to discover them), retro-styled animations and effects, and easter eggs and hidden features."
        ],
        "tags": ["JavaScript", "AI", "UX Design"]
    },
    {
        "id": "3",
        "title": "Building a Retro-Cyberpunk Portfolio",
        "date": "JULY 1, 2025",
        "content": [
            "When I decided to rebuild my portfolio, I wanted something that would stand out from the typical minimalist developer websites. Drawing inspiration from Blade Runner, old-school terminal interfaces, and synthwave aesthetics, I created this retro-cyberpunk themed portfolio.",
            "The design uses CSS grid for layout, custom animations for interactive elements, and a carefully chosen color palette that combines neon accents with deep, dark backgrounds. Everything is built with vanilla CSS and JavaScript - no frameworks needed."
        ],
        "tags": ["CSS", "JavaScript", "Design"]
    }
]